app/controllers/calories_bounds_controller.rb

  def edit
    @calories_bound = User.find(params[:user_id]).calories_bound
---
SELECT  "calories_bounds".* FROM "calories_bounds" WHERE "calories_bounds"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]